# Модуль 4: Интеграция и трансформация данных - ETL и ELT

## Модуль 4.3 Обзор рынка решений ETL

### Практика
1. Вам необходимо скачать и запустить Pentaho Data Integration Community Edition. Это бесплатный ETL инструмент, который работает на Windows, Linux и Mac. Вы можете скачать его отсюда. Pentaho DI требует установку Java 8. Попробуйте скачать архив и распаковать его. Вам нужно запустить spoon.sh для Linux/Mac и spoon.bat для Windows. У меня на Mac есть, например, иконка, Data integration. Если появятся вопросы, то задавайте их в Slack канале #de-module04-cohort1

### Выполнение:
